src/test/testtool/ZoekMetPostcodeEnHuisnummer/01/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><StUF:Fo03Bericht xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310"
                  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
                  xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310"
                  xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <StUF:stuurgegevens>
      <StUF:berichtcode>Fo03</StUF:berichtcode>
      <StUF:zender>
         <StUF:organisatie>test</StUF:organisatie>
         <StUF:applicatie>test123</StUF:applicatie>
      </StUF:zender>
      <StUF:ontvanger>
         <StUF:organisatie/>
         <StUF:applicatie>DEC_ZKN</StUF:applicatie>
         <StUF:administratie/>
         <StUF:gebruiker>TEST</StUF:gebruiker>
      </StUF:ontvanger>
      <StUF:referentienummer>fbf18cf7-fe6b-45fe-bf71-d5e5113a92ba</StUF:referentienummer>
      <StUF:tijdstipBericht>20241015062822722</StUF:tijdstipBericht>
      <StUF:crossRefnummer>25893868-0eb9-4a47-a055-260dfc1e7ed9</StUF:crossRefnummer>
   </StUF:stuurgegevens>
   <StUF:body>
      <StUF:code>500</StUF:code>
      <StUF:plek>server</StUF:plek>
      <StUF:omschrijving>some negative response from BRP API Personen received by PostBRPPersonenBevragenTestEnv</StUF:omschrijving>
      <StUF:details>TechnicalError some negative response from BRP API Personen received by PostBRPPersonenBevragenTestEnv </StUF:details>
      <StUF:detailsXML>
         <detailsXml>
            <root>
               <root>
                  <text>The app DEC_ZKN is not allowed for this request</text>
               </root>
            </root>
         </detailsXml>
      </StUF:detailsXML>
   </StUF:body>
</StUF:Fo03Bericht>
</soapenv:Body></soapenv:Envelope>